In [1]:
import pandas as pd
import seaborn as sns
df = sns.load_dataset("titanic")
# iloc: integer based selection
# loc: label based selection

In [3]:
df.iloc[0:3] # 0'dan 3'e kadar verileri getir

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [4]:
df.iloc[0,0] # 0.satır 0.sütün değerini getir

0

In [5]:
# loc mutlak olarak isimlendirmeyi seçiyor.
df.loc[0:3] # 0'dan 3'e kadar ama burada 3 de dahil.

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False

In [6]:
df.iloc[0:3, 0:3] # Belirli bir sütün ve satır değeri yazar

   survived  pclass     sex
0         0       3    male
1         1       1  female
2         1       3  female

In [7]:
df.loc[0:3,"age"] # Verdiğimiz "age" değişkeninin ilk 3 değeri

0    22.0
1    38.0
2    26.0
3    35.0
Name: age, dtype: float64

In [8]:
col_names = ["age","embarked","alive"]
df.loc[0:3,col_names] # Birden fazla değişkenin ilk 3 değerini gösterdik.

    age embarked alive
0  22.0        S    no
1  38.0        C   yes
2  26.0        S   yes
3  35.0        S   yes